diagrammer/SedMottak.dot
digraph SEDMottak {
    X_sedAlleredeBehandlet [label="X"];
    X_lagreIdentifisertPerson [label="X"];
    X_opprettOppgaveIdentifisering [label="X"];
    sedAlleredeBehandlet [shape=diamond];
    identifiserPerson [shape=diamond];
    erRinasakIdentifisert [shape=diamond];
    finnesIdOppgaveAllerede [shape=diamond];

    sedMottatt -> sedAlleredeBehandlet;
    sedAlleredeBehandlet -> X_sedAlleredeBehandlet [label="allerede behandlet"];

    sedAlleredeBehandlet -> lagreHendelse [label="ny"];
    lagreHendelse -> hentSED;
    hentSED -> identifiserPerson;

    identifiserPerson -> erRinasakIdentifisert [label="identifisert"];
    erRinasakIdentifisert -> X_lagreIdentifisertPerson [label="allerede identifisert"];
    erRinasakIdentifisert -> publiserEventBucIdentifisert [label="ikkeIdentifisert"]

    identifiserPerson -> finnesIdOppgaveAllerede [label="ikke identifisert"];
    finnesIdOppgaveAllerede -> X_opprettOppgaveIdentifisering [label="finnes"]
    finnesIdOppgaveAllerede -> opprettJP [label="finnes ikke"]
    opprettJP -> opprettOppgaveIdFordeling

    subgraph BucIdentifisert {
        harJpId [shape=diamond];
        opprettJP_BucIdentifisert [label="opprettJP"];
        hentAlleSEDMottatt [shape=rectangle, label="for hentAlleSEDMottatt"];

        eventBucIdentifisert -> hentAlleSEDMottatt;
        hentAlleSEDMottatt -> hentAlleSEDMottatt;
        hentAlleSEDMottatt -> harJpId [label="nei"];
        harJpId -> publiserSedMottatt [label="allerede JP"];
        harJpId -> opprettJP_BucIdentifisert [label="ingen jp"];
        opprettJP_BucIdentifisert -> publiserSedMottatt;
    }
}
